In [170]:
import pandas as pd
import json

In [172]:
df = pd.read_csv('/Users/adwiz/Downloads/extract-2023-06-20_14-36-05.csv')

In [173]:
df.head()

                       date                                            message
0  2023-06-20T11:35:59.772Z  {"duration":338791607,"start_time":16872609594...
1  2023-06-20T11:35:59.434Z  {"duration":725812,"start_time":16872609594333...
2  2023-06-20T11:35:52.359Z  {"duration":193138532,"start_time":16872609521...
3  2023-06-20T11:35:10.263Z  {"duration":19302105,"start_time":168726091024...
4  2023-06-20T11:35:09.873Z  {"duration":663741,"start_time":16872609098728...

In [190]:
ddf = pd.DataFrame(list(map(lambda x: json.loads(x)['db']['statement'], df.message.values)))

In [191]:
ddf

                                                      0
0     select c4s_user_id, first6, last4, payment_acc...
1     select c4s_user_id, first6, last4, payment_acc...
2     select c4s_user_id, first6, last4, payment_acc...
3     select Percent, AddedBy, Reason, ProducerID, C...
4     update OrderItems set SONumber = ? where id in...
...                                                 ...
4995  update centrobill_accounts set is_default = ? ...
4996  select * from centrobill_accounts where ( c4s_...
4997  select * from centrobill_accounts where ( c4s_...
4998  update c4s_payments set source = ? first6 = ? ...
4999  update c4s_payments set source = ? first6 = ? ...

[5000 rows x 1 columns]

In [201]:
df['sql'] = list(map(lambda x: json.loads(x)['db']['statement'], df.message.values))

In [202]:
df.head()

,date,message,sql
0,2023-06-20T11:35:59.772Z,"{""duration"":338791607,""start_time"":16872609594...","select c4s_user_id, first6, last4, payment_acc..."
1,2023-06-20T11:35:59.434Z,"{""duration"":725812,""start_time"":16872609594333...","select c4s_user_id, first6, last4, payment_acc..."
2,2023-06-20T11:35:52.359Z,"{""duration"":193138532,""start_time"":16872609521...","select c4s_user_id, first6, last4, payment_acc..."
3,2023-06-20T11:35:10.263Z,"{""duration"":19302105,""start_time"":168726091024...","select Percent, AddedBy, Reason, ProducerID, C..."
4,2023-06-20T11:35:09.873Z,"{""duration"":663741,""start_time"":16872609098728...",update OrderItems set SONumber = ? where id in...